backend/app/graphql/mutations/article/create_article.rb

      def resolve(input:)
        require_authentication!

        case input.author_type
        when "person"
          if input.person_date_of_birth
            author = ::Author.find_or_create_by!(name: input.author_name)
            ::Person.find_or_create_by!(author_id: author.id) do |person|
              person.birth_date = input.person_date_of_birth
            end
          else
            raise GraphQL::ExecutionError, "Data de nascimento é obrigatória para pessoa física"
          end

        when "institution"
          if input.institution_city
            author = ::Author.find_or_create_by!(name: input.author_name)
            ::Institution.find_or_create_by!(author_id: author.id) do |institution|
              institution.city = input.institution_city
            end
          else
            raise GraphQL::ExecutionError, "Cidade é obrigatória para instituição"
          end
        else
          raise GraphQL::ExecutionError, "Tipo de autor inválido: #{input.author_type}"
        end

        userCpf = context[:current_user].cpf

        material = ::Material.create!(
          title: input.title,
          description: input.description,
          status: input.status,
          user_cpf: userCpf,
          author_id: author.id
        )

        article = ::Article.create!(
          doi: input.doi,
          material_id: material.id,
          publication_date: input.publication_date,
          language: input.language
        )
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('João Silva', '2025-06-03 22:11:08.542149', '2025-06-03 22:11:08.542149') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'João Silva' LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('João Silva', '2025-06-03 03:33:54.820169', '2025-06-03 03:33:54.820169') RETURNING "id"
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('João Silva', '2025-06-03 14:04:07.031826', '2025-06-03 14:04:07.031826') RETURNING "id"
INSERT INTO "materials" ("title", "description", "status", "author_id", "user_cpf", "created_at", "updated_at") VALUES ('Título do artigo', 'Descrição opcional do material', 'publicado', 1, '1134567831440', '2025-06-03 22:11:09.007784', '2025-06-03 22:11:09.007784') RETURNING "id"
INSERT INTO "articles" ("doi", "material_id", "publication_date", "language", "created_at", "updated_at") VALUES ('10.1234/article-001', 1, '2024-11-12', 'Português', '2025-06-03 14:04:15.002270', '2025-06-03 14:04:15.002270') RETURNING "doi"
INSERT INTO "materials" ("title", "description", "status", "author_id", "user_cpf", "created_at", "updated_at") VALUES ('Avanços em Ciência de Dados', 'Um artigo que explora avanços recentes em ciência de dados.', 'publicado', 1, '1134567831430', '2025-06-03 03:34:05.394975', '2025-06-03 03:34:05.394975') RETURNING "id"