backend/app/graphql/mutations/article/delete_article.rb

SELECT "articles".* FROM "articles" WHERE "articles"."doi" = '10.1234/article-001' LIMIT 1
SELECT "materials".* FROM "materials" WHERE "materials"."id" = 1 LIMIT 1
DELETE FROM "articles" WHERE "articles"."doi" = '10.1234/article-001'
DELETE FROM "materials" WHERE "materials"."id" = 1
---
      def resolve(input:)
        require_authentication!
        doi = input[:doi]

        article  = ::Article.find_by!(doi: doi)
        material = ::Material.find_by!(id: article.material_id)

        user_cpf = context[:current_user].cpf
        raise GraphQL::ExecutionError, "Não autorizado" unless user_cpf == material.user_cpf

        ActiveRecord::Base.transaction do
          article.destroy!