backend/app/graphql/mutations/article/update_article.rb

SELECT "articles".* FROM "articles" WHERE "articles"."doi" = '10.1234/abc123' LIMIT 1
SELECT "materials".* FROM "materials" WHERE "materials"."id" = 1 LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Dra. Maria Silva', '2025-06-03 22:16:45.031702', '2025-06-03 22:16:45.031702') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'Dra. Maria Silva' LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Dra. Maria Silva', '2025-06-03 13:46:04.220128', '2025-06-03 13:46:04.220128') RETURNING "id"
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Dra. Maria Silva', '2025-06-03 14:04:26.761791', '2025-06-03 14:04:26.761791') RETURNING "id"
UPDATE "materials" SET "title" = 'Título Atualizado', "description" = 'Nova descrição do artigo', "status" = 'rascunho', "author_id" = 2, "updated_at" = '2025-06-03 22:16:52.595235' WHERE "materials"."id" = 1
UPDATE "articles" SET "publication_date" = '2024-12-01', "updated_at" = '2025-06-03 22:16:52.600694' WHERE "articles"."doi" = '10.1234/abc123'
---
      def resolve(input:)
        require_authentication!

        article = ::Article.find_by!(doi: input[:doi])
        material = ::Material.find_by!(id: article.material_id)
        user_cpf = context[:current_user].cpf
        raise GraphQL::ExecutionError, "Não autorizado" unless user_cpf == material.user_cpf

        author = nil
        if input[:author_name] && input[:author_type]
          case input[:author_type]
          when "person"
            raise GraphQL::ExecutionError, "Data de nascimento obrigatória" unless input[:person_date_of_birth]
            author = ::Author.find_or_create_by!(name: input[:author_name])
            ::Person.find_or_create_by!(author_id: author.id) do |p|
              p.birth_date = input[:person_date_of_birth]
            end
          when "institution"
            raise GraphQL::ExecutionError, "Cidade obrigatória" unless input[:institution_city]
            author = ::Author.find_or_create_by!(name: input[:author_name])
            ::Institution.find_or_create_by!(author_id: author.id) do |i|
              i.city = input[:institution_city]
            end
          else
            raise GraphQL::ExecutionError, "Tipo de autor inválido"
          end
        end

        material.update!(
          title: input[:title] || material.title,
          author_id: author&.id || material.author_id,
          description: input[:description] || material.description,
          status: input[:status] || material.status,
          publication_date: input[:publicationDate] || material.publication_date
        )

        article.update!(
          publication_date: input[:publication_date] || article.publication_date,
          language: input[:language] || article.language
        )