backend/app/graphql/mutations/person/create_person.rb

      def resolve(input:)
        author = Author.create!(name: input.name)
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Maria Silva', '2025-06-04 21:31:43.401230', '2025-06-04 21:31:43.401230') RETURNING "id"