backend/app/graphql/mutations/person/delete_person.rb

      def resolve(input:)
        person = ::Person.find_by!(id: input.id)
        author = ::Author.find_by!(id: person.author_id)

        person.destroy!
        author.destroy!
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1
DELETE FROM "authors" WHERE "authors"."id" = 1