backend/app/graphql/types/query_type.rb

    def user_by_cpf(cpf:)
      ::User.find_by(cpf: cpf)
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '1134567831410' LIMIT 1

    def person_by_id(id:)
      ::Person.includes(:author).find_by(id: id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1

    def institution_by_id(id:)
      ::Institution.includes(:author).find_by(id: id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 7
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = 1 LIMIT 1

    def video_by_id(id:)
      ::Video.includes(material: :author).find_by(id: id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 4
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 3 LIMIT 1

    def article_by_doi(doi:)
      ::Article.find_by(doi: doi)
---
SELECT "articles".* FROM "articles" WHERE "articles"."doi" = '10.1234/article-001' LIMIT 1

    def book_by_isbn(isbn:)
      ::Book.find_by(isbn: isbn)
---
SELECT "books".* FROM "books" WHERE "books"."isbn" = '978-1234567890' LIMIT 1