app/graphql/mutations/institution/delete_institution.rb

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = 1 LIMIT 1
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 4 LIMIT 1
DELETE FROM "institutions" WHERE "institutions"."id" = 1
DELETE FROM "authors" WHERE "authors"."id" = 4
---
      def resolve(id:)
        institution = ::Institution.find_by!(id: id)
        author = ::Author.find_by!(id: institution.author_id)

        institution.destroy!