backend/app/graphql/mutations/user/create_user.rb

      def resolve(input:)
        number_cpf = input[:cpf].gsub(/\D/, "")

        user = ::User.create!(
          cpf: number_cpf,
          name: input[:name],
          mail: input[:mail],
          password: input[:password]
        )
---
INSERT INTO "users" ("cpf", "name", "mail", "password_digest") VALUES ('1134567831440', 'João Teste', 'jodde@email.com', '$2a$12$xeB3ADDunMEy/NgKdApRCOz4eqAUvCsZy1VvqixS6BqU3dTYfM8jm') RETURNING "cpf"