backend/app/graphql/mutations/user/delete_user.rb

      def resolve(input:)
        require_authentication!
        user = context[:current_user]
        raise GraphQL::ExecutionError, "Nao autorizado" unless user.cpf == input[:cpf]

        user.destroy!
---
DELETE FROM "users" WHERE "users"."cpf" = '12345678900'