backend/app/graphql/mutations/user/login_user.rb

      def resolve(input:)
        user = ::User.find_by(mail: input[:mail])
---
SELECT "users".* FROM "users" WHERE "users"."mail" = 'jodde@email.com' LIMIT 1