backend/app/graphql/mutations/user/update_user.rb

      def resolve(input:)
        require_authentication!
        user = context[:current_user]

        user.update!(
          name: input[:name] || user.name,
          mail: input[:mail] || user.mail,
        )
---
UPDATE "users" SET "name" = 'Novo Nome', "mail" = 'novoemail@exemplo.com', "password_digest" = '$2a$12$WP3rMH2dCXbTPgPQwiCaYup0YRT0Axsfhp5DI1zZ1VpHOmO/IJ7JG' WHERE "users"."cpf" = '1134567831410'