backend/app/graphql/mutations/video/create_video.rb

      def resolve(input:)
        require_authentication!

        if input[:authorName].blank? || (input[:personDateOfBirth].blank? && input[:institutionCity].blank?)
          raise GraphQL::ExecutionError, "Nome do autor e pelo menos uma informação de pessoa ou instituição devem ser fornecidos"
        end

        case input[:authorType]
        when "person"
          raise GraphQL::ExecutionError, "Data de nascimento é obrigatória para pessoa física" unless input[:personDateOfBirth]

          author = ::Author.find_or_create_by!(name: input[:authorName])
          ::Person.find_or_create_by!(author_id: author.id) do |person|
            person.birth_date = input[:personDateOfBirth]
          end

        when "institution"
          raise GraphQL::ExecutionError, "Cidade é obrigatória para instituição" unless input[:institutionCity]

          author = ::Author.find_or_create_by!(name: input[:authorName])
          ::Institution.find_or_create_by!(author_id: author.id) do |institution|
            institution.city = input[:institutionCity]
          end

        else
          raise GraphQL::ExecutionError, "Tipo de autor inválido: #{input[:authorType]}"
        end

        userCpf = context[:current_user].cpf

        material = ::Material.create!(
          title: input[:title],
          category: input[:category],
          description: input[:description],
          status: input[:status],
          author_id: author.id,
          user_cpf: userCpf,
          publication_date: input[:publicationDate]

        )

        video = ::Video.create!(
          duration_minutes: input[:durationMinutes],
          material_id: material.id
        )
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Maria da Silva', '2025-06-04 01:52:42.753854', '2025-06-04 01:52:42.753854') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'Maria da Silva' LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('dodo', '2025-06-02 18:58:12.516154', '2025-06-02 18:58:12.516154') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'dodo' LIMIT 1
SELECT "institutions".* FROM "institutions" WHERE "institutions"."author_id" = 4 LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('dodo', '2025-06-03 14:33:47.092310', '2025-06-03 14:33:47.092310') RETURNING "id"
INSERT INTO "institutions" ("author_id", "city", "created_at", "updated_at") VALUES (4, 'recife', '2025-06-03 14:33:47.116824', '2025-06-03 14:33:47.116824') RETURNING "id"
INSERT INTO "materials" ("title", "description", "status", "author_id", "user_cpf", "created_at", "updated_at") VALUES ('video2', 'Descrição do vídeo (opcional)', 'publicado', 4, '1134567831410', '2025-06-02 19:04:19.955554', '2025-06-02 19:04:19.955554') RETURNING "id"
INSERT INTO "materials" ("title", "description", "status", "author_id", "user_cpf", "created_at", "updated_at") VALUES ('video2', 'Descrição do vídeo (opcional)', 'publicado', 4, '1134567831410', '2025-06-03 14:33:47.143074', '2025-06-03 14:33:47.143074') RETURNING "id"
INSERT INTO "videos" ("material_id", "duration_minutes", "created_at", "updated_at") VALUES (11, 45, '2025-06-02 19:04:19.972251', '2025-06-02 19:04:19.972251') RETURNING "id"