backend/app/graphql/mutations/video/delete_video.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1
SELECT "materials".* FROM "materials" WHERE "materials"."id" = 2 LIMIT 1
DELETE FROM "videos" WHERE "videos"."id" = 1
DELETE FROM "materials" WHERE "materials"."id" = 2
---
      def resolve(input:)
        video = ::Video.find_by!(id: input[:id])
        material = ::Material.find_by!(id: video.material_id)

        video.destroy!
        material.destroy!