backend/app/graphql/mutations/video/update_video.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1
SELECT "materials".* FROM "materials" WHERE "materials"."id" = 2 LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('dodo', '2025-06-04 01:59:38.073966', '2025-06-04 01:59:38.073966') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'dodo' LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('João Silva', '2025-06-02 19:13:39.441043', '2025-06-02 19:13:39.441043') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'João Silva' LIMIT 1
UPDATE "materials" SET "title" = 'Título Atualizado', "description" = 'Descrição atualizada do vídeo', "status" = 'publicado', "updated_at" = '2025-06-02 19:13:39.475075' WHERE "materials"."id" = 8
UPDATE "videos" SET "duration_minutes" = 45, "updated_at" = '2025-06-04 01:59:38.115143' WHERE "videos"."id" = 1
---
      def resolve(input:)
        video = ::Video.find_by!(id: input[:id])
        material = ::Material.find_by!(id: video.material_id)
        author = nil

        if input[:authorName] && input[:authorType]
          case input[:authorType]
          when "person"
            raise GraphQL::ExecutionError, "Data de nascimento obrigatória" unless input[:personDateOfBirth]

            author = ::Author.find_or_create_by!(name: input[:authorName])
            ::Person.find_or_create_by!(author_id: author.id) do |p|
              p.birth_date = input[:personDateOfBirth]
            end

          when "institution"
            raise GraphQL::ExecutionError, "Cidade obrigatória" unless input[:institutionCity]

            author = ::Author.find_or_create_by!(name: input[:authorName])
            ::Institution.find_or_create_by!(author_id: author.id) do |i|
              i.city = input[:institutionCity]
            end

          else
            raise GraphQL::ExecutionError, "Tipo de autor inválido"
          end
        end

        material.update!(
          title: input[:title] || material.title,
          author_id: author&.id || material.author_id,
          description: input[:description] || material.description,
          status: input[:status] || material.status,
          publication_date: input[:publicationDate] || material.publication_date
        )

        video.update!(duration_minutes: input[:durationMinutes]) unless input[:durationMinutes].nil?