app/graphql/mutations/person/update_person.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1
UPDATE "authors" SET "name" = 'João da Silva Atualizado', "updated_at" = '2025-06-01 19:11:04.848068' WHERE "authors"."id" = 1
---
      def resolve(id:, name: nil, birthDate: nil)
        person = ::Person.find_by!(id: id)
        author = ::Author.find_by!(id: person.author_id)

        author.update!(name: author.name || name)