backend/app/graphql/mutations/institution/create_institution.rb

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Instituto Alpha', '2025-06-04 19:59:55.674966', '2025-06-04 19:59:55.674966') RETURNING "id"
INSERT INTO "institutions" ("author_id", "city", "created_at", "updated_at") VALUES (5, 'São Paulo', '2025-06-04 19:59:55.717316', '2025-06-04 19:59:55.717316') RETURNING "id"
---
      def resolve(input:)
        author = ::Author.create!(name: input.name)
        institution = ::Institution.create!(city: input.city, author_id: author.id)