backend/app/graphql/mutations/institution/update_institution.rb

      def resolve(input:)
        institution = ::Institution.find_by!(id: input.id)
        author = ::Author.find_by!(id: institution.author_id)

        author.update!(name: input.name) if input.name.present?
        institution.update!(city: input.city) if input.city.present?
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = 1 LIMIT 1
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1
UPDATE "authors" SET "name" = 'Novo Nome do Autor', "updated_at" = '2025-06-04 20:00:05.623744' WHERE "authors"."id" = 4
UPDATE "authors" SET "name" = 'Novo Nome do Autor', "updated_at" = '2025-06-02 16:38:19.870411' WHERE "authors"."id" = 1
UPDATE "institutions" SET "city" = 'Nova Cidade da Instituição', "updated_at" = '2025-06-04 20:00:05.633059' WHERE "institutions"."id" = 1