backend/app/graphql/mutations/book/create_book.rb

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Dr. Stella Nova', '2025-06-04 02:04:02.614176', '2025-06-04 02:04:02.614176') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'Dr. Stella Nova' LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Autor Exemplo', '2025-06-02 21:43:47.190165', '2025-06-02 21:43:47.190165') RETURNING "id"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = 'Autor Exemplo' LIMIT 1
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ('Autor Exemplo', '2025-06-03 14:18:07.251958', '2025-06-03 14:18:07.251958') RETURNING "id"
---
      def resolve(input:)
        require_authentication!

        if input[:authorName].blank? || (input[:personDateOfBirth].blank? && input[:institutionCity].blank?)
          raise GraphQL::ExecutionError, "Nome do autor e pelo menos data de nascimento ou cidade devem ser fornecidos"
        end

        case input[:authorType]
        when "person"
          if input[:personDateOfBirth]
            author = ::Author.find_or_create_by!(name: input[:authorName])
            ::Person.find_or_create_by!(author_id: author.id) do |person|
              person.birth_date = input[:personDateOfBirth]
            end
          else
            raise GraphQL::ExecutionError, "Data de nascimento é obrigatória para pessoa física"
          end

        when "institution"
          if input[:institutionCity]
            author = ::Author.find_or_create_by!(name: input[:authorName])
            ::Institution.find_or_create_by!(author_id: author.id) do |institution|

INSERT INTO "materials" ("title", "description", "status", "author_id", "user_cpf", "created_at", "updated_at") VALUES ('O Livro das Estrelas', 'Uma aventura pelo cosmos.', 'publicado', 5, '1134567831440', '2025-06-04 02:04:02.652788', '2025-06-04 02:04:02.652788') RETURNING "id"
INSERT INTO "books" ("isbn", "material_id", "page_numbers", "created_at", "updated_at") VALUES ('9781234567890', 1, 250, '2025-06-02 21:43:47.429154', '2025-06-02 21:43:47.429154') RETURNING "isbn"
---

        userCpf = context[:current_user].cpf

        material = ::Material.create!(
          title: input[:title],
          category: input[:category],
          description: input[:description],
          status: input[:status],
          author_id: author.id,
          user_cpf: userCpf,
          publication_date: input[:publicationDate]
        )

        number_isbn = input[:isbn].gsub(/\D/, '')
        book = ::Book.create!(
          isbn: number_isbn,
          page_numbers: input[:pageNumbers],
          material_id: material.id
        )