backend/app/graphql/mutations/book/delete_book.rb

      def resolve(input:)
        book = ::Book.find_by!(isbn: input[:isbn])
        material = ::Material.find_by!(id: book.material_id)

        userCpf = context[:current_user].cpf
        raise GraphQL::ExecutionError, "Nao autorizado" unless userCpf == material.user_cpf

        book.destroy!
        material.destroy!
---
SELECT "books".* FROM "books" WHERE "books"."isbn" = '978-1234567890' LIMIT 1
SELECT "materials".* FROM "materials" WHERE "materials"."id" = 3 LIMIT 1
DELETE FROM "books" WHERE "books"."isbn" = '978-1234567890'
DELETE FROM "materials" WHERE "materials"."id" = 3