app/controllers/graphql_controller.rb

  def current_user
    return nil unless decoded_token
    ::User.find_by(cpf: decoded_token[:cpf])
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '1134567831410' LIMIT 1